
Процедура ОбработкаПроведения(Отказ, Режим)		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Товар КАК Товар,
		|	ОстаткиТоваровОстатки.Склад КАК СкладОстатков,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ПродажаТовараСписокТоваров.Количество КАК КоличествоПродажа
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&период, Склад = &Склад) КАК ОстаткиТоваровОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаТовара.СписокТоваров КАК ПродажаТовараСписокТоваров
		|		ПО ОстаткиТоваровОстатки.Товар = ПродажаТовараСписокТоваров.Товар
		|ГДЕ
		|	ПродажаТовараСписокТоваров.Ссылка = &Док";
	
	Запрос.УстановитьПараметр("период", Дата); 
	Запрос.УстановитьПараметр("Док", Ссылка);	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если  РезультатЗапроса.Пустой()Тогда
		Сообщить("Недостаточно товара ");
		Отказ = Истина;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	
	
	Пока Выборка.Следующий() Цикл
		 НедостатокТовара = Выборка.КоличествоОстаток - Выборка.КоличествоПродажа ;		
		 Если НедостатокТовара < 0 Тогда
		    Сообщить("Недостаточно товара " + Выборка.Товар + " в количестве" + -НедостатокТовара);
		 	Отказ = Истина;
		 КонецЕсли;
	КонецЦикла;
		

	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТоваров Из СписокТоваров Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаСписокТоваров.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаСписокТоваров.Количество;
	КонецЦикла;
	
КонецПроцедуры
